SITE = 'http://selet.biz'

CAMPS_KEYWORDS = (
    'camps',
    'аланнар',
    'лагеря'
)

APPLICATIONS_KEYWORDS = (
    'applications',
    'гаризалар',
    'заявки'
)

PROJECTS_KEYWORDS = (
    'projects',
    'проектлар',
    'проекты'
)

BON_APPETITE_KEYWORDS = (
    'bon appetit',
    'bon appetite'
    'enjoy your meal',
    'аш булсын',
    'приятного аппетита',
    '🍚'
)

COOL_KEYWORDS = (
    'cool',
    'отлично',
    'шәп',
    '👍'
)

LOVE_KEYWORDS = (
    'love',
    'люблю',
    'яратам',
    '❤'
)

STICKER_KEYWORDS = BON_APPETITE_KEYWORDS + COOL_KEYWORDS + LOVE_KEYWORDS

CAMPS_NAMES_KEYWORDS = {
    'Азнакай': ('азнакай', 'азнакаево',),
    'АкБүре': ('акбүре', 'акбүре', 'ак бүре', 'ак буре', 'акбуре',),
    'Байлар Cабасы': ('саба', 'сабы', 'богатые сабы', 'байлар сабасы',),
    'Батыр': ('батыр', 'чувашия', 'богатырь',),
    'Биләр каласы': ('биляр', 'биляр каласы', 'билярск', 'билэр каласы', 'биләр каласы', 'биләр',),
    'Болгар-Туган тел': ('болгар туган тел', 'бтт', 'болгар',),
    'Гайрәт': ('гайрэт', 'буа', 'Гайрәт',),
    'Имәнкәй': ('Имәнкәй', 'дуб', 'имэнкэй',),
    'Иске Казан': ('тске казан', 'старая казань',),
    'Олимп': ('олимп',),
    'Осталар бистәсе': ('осталар бистәсе', 'об', 'осталар бистэсе'),
    'Раушан': ('раушан',),
    'Рухият': ('рухият', 'рух',),
    'Самара': ('самара',),
    'Санак': ('санак', 'санак-лаб', 'санак лаб', 'sanak-lab', 'sanaklab',),
    'Тел': ('тел', 'язык',),
    'Тулпар': ('тулпар', 'кардракул', 'башкирия',),
    'Шәхес (КВН)': ('шәхес (КВН)', 'шәхес', 'квн',),
    'Яр Чаллы': ('яр чаллы', 'чаллы', 'челны',),
}

CAMPS_KEYWORDS_NAMES = {keyword: camp for camp, words in CAMPS_NAMES_KEYWORDS.items() for keyword in words}

START_MESSAGE = 'Привет! Я бот молодежного движения [Сәләт](http://selet.biz/).\n' \
                'Я пока еще маленький, поэтому умею мало, но я развиваюсь и каждый день изучаю что-то новое.' \
                'Давай вместе!'
HELP_MESSAGE = 'Я умею выводить список лагерей, проектов и доступных заявкок\n' \
               '/help - вывести данное сообщение'
DO_NOT_UNDERSTAND_MESSAGE = '_Я тебя не понимаю_'

STICKER_ID = {
    'bon appetite': 'CAADAgADTAgAAnLvWgUxEsiriE91rAI',
    'cool': 'CAADAgADSggAAnLvWgWPSApReQJ-cQI',
    'love': 'CAADAgADSAgAAnLvWgUxx7_RczuKiwI'
}
