SITE = 'http://selet.biz'

CAMPS_KEYWORDS = (
    'camps',
    'аланнар',
    'лагеря'
)

APPLICATIONS_KEYWORDS = (
    'applications',
    'гаризалар',
    'заявки'
)

PROJECTS_KEYWORDS = (
    'projects',
    'проектлар',
    'проекты'
)

BON_APPETITE_KEYWORDS = (
    'bon appetit',
    'bon appetite'
    'enjoy your meal',
    'аш булсын',
    'приятного аппетита',
    '🍚'
)

COOL_KEYWORDS = (
    'cool',
    'отлично',
    'шәп',
    '👍'
)

LOVE_KEYWORDS = (
    'love',
    'люблю',
    'яратам',
    '❤'
)

CAMPS_NAMES = (
    'лагеря подробно'
)

START_MESSAGE = 'Привет! Я бот молодежного движения [Сәләт](http://selet.biz/).\n'\
                'Я пока еще маленький, поэтому умею мало, но я развиваюсь и каждый день изучаю что-то новое.' \
                'Давай вместе!'
HELP_MESSAGE = 'Я умею выводить список лагерей, проектов и доступных заявкок\n'\
               '/help - вывести данное сообщение'
